Revit 2024 API
BuiltInFailures.RebarCouplerFailures.NoBarSizeError Property
 This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoBarSizeError { get; }
Visual Basic
Public Shared ReadOnly Property NoBarSizeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoBarSizeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace